{
  "basics": {
    "name": "Abraham J. Marsh",
    "label": "Electrical Engineering Student",
    "image": "",
    "email": "amarsh41@gatech.edu",
    "phone": "(808) 439-5255",
    "url": "",
    "summary": "Electrical Engineering student with a strong foundation in digital design, circuit analysis, and embedded systems. Experience developing automated systems and optimizing processes to enhance efficiency and compliance. Seeking an internship in robotics, embedded systems, or hardware engineering starting May 2026. Willing to relocate.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Honolulu",
      "countryCode": "US",
      "region": "Hawaii"
    },
    "profiles": []
  },

  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "location": "Atlanta, GA",
      "url": "https://www.gatech.edu",
      "area": "Electrical Engineering",
      "studyType": "Bachelor of Science",
      "startDate": "2022-07-01",
      "endDate": "2026-12-01",
      "score": "GPA 3.88",
      "courses": [
        "Advanced Programming Techniques",
        "Embedded Systems",
        "Digital Design Lab",
        "Microelectronics",
        "Circuit Analysis",
        "Signals and Systems",
        "Electromagnetics",
        "Analog Electronics"
      ]
    }
  ],

  "work": [
    {
      "name": "L3Harris Technologies",
      "location": "Alpharetta, Georgia",
      "position": "Systems Engineering Intern",
      "url": "",
      "startDate": "2025-05-01",
      "endDate": "2025-08-01",
      "summary": "",
      "highlights": [
        "Engineered a Python-based touchscreen GUI on Raspberry Pi to control and automate 18 industrial PCB reflow ovens, streamlining operator data entry and reducing errors.",
        "Integrated oven controller GUI with factory SQL database for configuration and bake data logging, ensuring full traceability of each PCB product across its unique 3–10 bake cycles and supporting failure analysis.",
        "Established a local Git repository on the factory network for collaboration and version control of the oven controller GUI.",
        "Automated oven controller GUI updates, ensuring consistent functionality across 18 ovens and removing manual intervention.",
        "Wrote DXL scripts for IBM DOORS to create requirements traceability matrices and detect missing links between requirements, test cases, and test results for over 200 high-level requirements.",
        "Built a multi-threaded Python parser to process over 10 million test data points for the highest-volume product, standardized database updates, and integrated results into Power BI for streamlined analysis."
      ]
    },
    {
      "name": "Georgia Tech Integrated Computational Electronics Lab",
      "location": "Atlanta, Georgia",
      "position": "Undergraduate Researcher",
      "url": "",
      "startDate": "2024-08-01",
      "endDate": "2025-05-01",
      "summary": "",
      "highlights": [
        "Integrated analog circuits into an FPAA (Field Programmable Analog Array) audio feature extraction chain, validating toolchain improvements and demonstrating analog computing applications.",
        "Developed a fixed-location feature in the Python toolchain to constrain circuit placement on the FPAA, minimizing parasitic capacitance and routing losses.",
        "Optimized delay circuit for FPAA architecture to achieve 15 microsecond delays, improving from previous 5 microseconds.",
        "Quantitatively characterized delay and attenuation across frequencies and biasing modes to assess design trade-offs."
      ]
    },
    {
      "name": "Fluke Corporation",
      "location": "Everett, Washington",
      "position": "Electrical Test Engineer Intern",
      "url": "",
      "startDate": "2024-05-01",
      "endDate": "2024-08-01",
      "summary": "",
      "highlights": [
        "Troubleshot and maintained test stations across 27 product lines including digital multimeters, clamps, and process calibrators.",
        "Used TestStand, LabVIEW, and NI Vision Assistant to create an Automated Optical Inspection station scanning 600+ DMMs daily to prevent shipment of incorrect or damaged units.",
        "Integrated AOI station with factory database to auto-generate detailed failure reports, enabling rapid technician resolution and catching an average of 11 erroneous units daily.",
        "Delivered AOI station cost, setup, and maintenance plan enabling replication by the plastics department.",
        "Owned investigation of a 4% clamp meter failure rate, traced root cause to EMI shielding contacting beeper leads due to out-of-tolerance parts, and implemented supplier-side lead trimming as a cost-effective countermeasure.",
        "Presented Run Through Yield and Defective Parts Per Million metrics and facilitated cross-functional communication during daily factory quality meetings."
      ]
    }
  ],

  "projects": [
    {
      "name": "ARM Processor Based RPG Game",
      "summary": "Top-down 2D RPG game developed in C++ on an ARM-based MBED platform.",
      "highlights": [
        "Developed a 2D game with two maps, four quests, collectible items and powerups, four enemies, a scoreboard, and a final boss.",
        "Programmed a custom linked-list hash table to store approximately 3500 map items.",
        "Implemented save and load functionality using an SD card for power-off persistent game state."
      ],
      "startDate": "2024-12-01",
      "endDate": "2024-12-01",
      "url": ""
    },
    {
      "name": "Home SSH Server",
      "summary": "Personal Linux server for remote access and hosting services.",
      "highlights": [
        "Repurposed an old laptop into a Linux server for hosting websites and game servers via SSH.",
        "Implemented fail2ban, non-default SSH ports, and SSH key-based authentication to secure the server and home network.",
        "Configured port forwarding through two routers to enable worldwide SSH access."
      ],
      "startDate": "2024-01-01",
      "endDate": "2024-01-01",
      "url": ""
    },
    {
      "name": "Servo Motor Driver on FPGA",
      "summary": "Team-based FPGA motor control system.",
      "highlights": [
        "Designed a VHDL-based servo controller capable of independently driving four servos with 180-degree resolution.",
        "Implemented PWM generation using four 8-bit registers with output clamping to prevent servo damage.",
        "Added servo linking capability via a fifth register to allow grouped motor control.",
        "Used SignalTap logic analyzer to debug and validate FPGA implementation."
      ],
      "startDate": "2024-04-01",
      "endDate": "2024-04-01",
      "url": ""
    }
  ],

  "skills": [
    {
      "name": "Programming",
      "keywords": ["Python", "C", "C++", "Java", "MATLAB", "C#", "SQL", "Assembly", "VHDL", "IBM DOORS/DXL"]
    },
    {
      "name": "Software Tools",
      "keywords": ["LabVIEW", "TestStand", "Git", "GitHub", "JIRA", "Confluence", "PLM", "Fusion 360", "Cura Slicer", "Prusa Slicer", "Power BI"]
    },
    {
      "name": "Hardware & Embedded Systems",
      "keywords": ["FPGA", "ARM Processor", "RTOS", "Arduino", "Raspberry Pi", "Linux", "SSH", "Altera Quartus", "Xilinx"]
    },
    {
      "name": "Fabrication & Prototyping",
      "keywords": ["3D Printing", "Laser Cutting", "Soldering"]
    },
    {
      "name": "Lab Equipment",
      "keywords": ["Oscilloscope", "Function Generator", "LCR Meter", "DMM", "Calibrators"]
    },
    {
      "name": "Engineering Practices",
      "keywords": ["Failure Analysis", "Root Cause Analysis", "Process Optimization", "Requirements Management"]
    },
    {
      "name": "Communication",
      "keywords": ["Large Group Presentation", "Cross-Functional Collaboration", "Technical Manuals and Reviews"]
    }
  ],

  "publications": [
    {
      "name": "Extending and Validating High Level Synthesis Tools for Analog Computing on Field Programmable Analog Arrays",
      "publisher": "IEEE Opportunity Research Scholars Symposium (ORSS)",
      "releaseDate": "2025-01-01",
      "url": "https://doi.org/10.1109/ORSS66051.2025.11121627",
      "summary": "A. Marsh et al., presented research extending and validating analog computing synthesis tools for FPAA platforms."
    },
    {
      "name": "Performance of large-format deformable mirrors constructed with hybrid variable reluctance actuators III: laboratory measurements of dynamic behavior",
      "publisher": "Adaptive Optics for Extremely Large Telescopes",
      "releaseDate": "2023-06-01",
      "url": "",
      "summary": "Laboratory characterization of dynamic behavior of large-format deformable mirrors using hybrid variable reluctance actuators."
    }
  ],

  "volunteer": [
    {
      "organization": "Hive Makerspace",
      "location": "Georgia Tech",
      "position": "Peer Instructor, Machine Shop Specialist",
      "startDate": "2023-01-01",
      "endDate": "2025-08-01",
      "summary": "",
      "highlights": [
        "Assisted students with use of makerspace tools including laser cutters, 3D printers, and woodworking machines.",
        "Consulted students on academic and personal projects to achieve desired outcomes within tool and design constraints."
      ]
    },
    {
      "organization": "Kaiser High School",
      "location": "Honolulu, Hawaii",
      "position": "IB Physics Tutor",
      "startDate": "2023-01-01",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "Tutored 3–6 IB Physics students weekly in online sessions.",
        "Achieved an average test score improvement of 37% between first and final tutoring sessions.",
        "Prepared individualized weekly lesson plans tailored to student learning pace and needs."
      ]
    }
  ]
}
